In [5]:
import pandas as pd 
from datetime import datetime, date, timedelta
from itertools import combinations

In [6]:
DATE_FORMAT = "%Y-%m-%d"
TODAY_DT = date.today() #.strftime(DATE_FORMAT)

# 1. Loading the csv of dates

In [7]:
events_df = pd.read_csv("events.csv")
events_df.head()

            event        date  importance category
0          Philip  1921-06-10           1    birth
1       Elizabeth  1926-04-21           1    birth
2      Engagement  1947-07-09           3     both
3         Wedding  1947-11-20           2     both
4  Charles' birth  1948-11-14           2    child

In [8]:
# adding a column dt with format datetime.date()

events_df['dt'] = events_df['date'].apply(lambda x: datetime.strptime(x, DATE_FORMAT).date())
events_df.head()

            event        date  importance category          dt
0          Philip  1921-06-10           1    birth  1921-06-10
1       Elizabeth  1926-04-21           1    birth  1926-04-21
2      Engagement  1947-07-09           3     both  1947-07-09
3         Wedding  1947-11-20           2     both  1947-11-20
4  Charles' birth  1948-11-14           2    child  1948-11-14

In [9]:
events = events_df.set_index('event').transpose().to_dict()
events

{'Philip': {'date': '1921-06-10',
  'importance': 1,
  'category': 'birth',
  'dt': datetime.date(1921, 6, 10)},
 'Elizabeth': {'date': '1926-04-21',
  'importance': 1,
  'category': 'birth',
  'dt': datetime.date(1926, 4, 21)},
 'Engagement': {'date': '1947-07-09',
  'importance': 3,
  'category': 'both',
  'dt': datetime.date(1947, 7, 9)},
 'Wedding': {'date': '1947-11-20',
  'importance': 2,
  'category': 'both',
  'dt': datetime.date(1947, 11, 20)},
 "Charles' birth": {'date': '1948-11-14',
  'importance': 2,
  'category': 'child',
  'dt': datetime.date(1948, 11, 14)},
 "Anne's birth": {'date': '1950-08-15',
  'importance': 2,
  'category': 'child',
  'dt': datetime.date(1950, 8, 15)},
 'Beginning of reign': {'date': '1952-02-06',
  'importance': 1,
  'category': 'both',
  'dt': datetime.date(1952, 2, 6)},
 'Coronation': {'date': '1953-06-02',
  'importance': 2,
  'category': 'both',
  'dt': datetime.date(1953, 6, 2)},
 "Andrew's birth": {'date': '1960-02-19',
  'importance': 2,
  'category': 'child',
  'dt': datetime.date(1960, 2, 19)},
 "Edward's birth": {'date': '1964-03-10',
  'importance': 2,
  'category': 'child',
  'dt': datetime.date(1964, 3, 10)},
 "Philip's death": {'date': '2021-04-09',
  'importance': 2,
  'category': 'death',
  'dt': datetime.date(2021, 4, 9)},
 "Elizabeth's death": {'date': '2022-09-08',
  'importance': 1,
  'category': 'death',
  'dt': datetime.date(2022, 9, 8)}}

# 2. Functions

## 2.1. Secondary functions

In [10]:
def stod(dt_str):
    """Converts string variable `dt_str` to date.
    
    Args:
        dt_str (str): The string date in `DATE_FORMAT` format.
        
    Returns:
        Date
    """
    return datetime.strptime(dt_str, DATE_FORMAT).date()

In [11]:
def days_between(dt1, dt2):
    """Calculates difference between `dt1` and `dt2`.
    
    Args:
        dt1 (date): The first date.
        dt2 (date): The second date.
        
    Returns:
        Boolean
    """
    try:
        return abs((dt2 - dt1).days)
    except:
        return None

In [12]:
# iterator by date
# input and output format: date(YYYY, MM, DD) 

def daterange(start_dt, end_dt):
    """Generates a range of dates from `start_dt` to `end_dt` (including the ends).
    
    Args:
        start_dt (date): The start date.
        end_dt (date): The end date.
        
    Returns:
        Iterator of dates (date)
    """
    for n in range(int((end_dt - start_dt).days) + 1):
        yield start_dt + timedelta(n)

In [13]:
# rules for detecting anniversaries
# input format: date(YYYY, MM, DD) 

def rule_multiple(dt1, dt2, n):
    """Identifies if difference between 2 dates `dt1` and `dt2` is multiple of `n`.
    
    Args:
        dt1 (date): 
        dt2 (date): 
        n (int): The number of multiplicity.
        
    Returns:
        Boolean
    """
    if days_between(dt1, dt2) % n == 0:
        return True
    else:
        return False

def rule_anniversary(dt1, dt2):
    """Identifies if `dt1` is an anniversary of `dt2` or vice versa.
    
    Args:
        dt1 (date): 
        dt2 (date): 
        
    Returns:
        Int or None
    """
    if dt1.month == dt2.month and dt1.day == dt2.day:
        return abs(dt1.year - dt2.year)
    else:
        return None

In [16]:
def birth_dates():
    """Returns dictionary with dates of all births in events dictionary.
    
    Returns:
        Dict
    """
    birth_dict = {}
    for k, v in events.items():
        if v['category'] == 'birth':
            birth_dict[k] = v['dt']    
    return birth_dict

## 2.2. Functions for FastAPI

In [46]:
def today_counter():
    """Returns DataFrame with amounts of days since every event in events dictionary.
    
    Returns:
        DataFrame
    """
    output_dict = {}
#     print("Today is...")
    
    try:
        for event in events.keys():
#             print("{} days since {}".format(days_between(TODAY_DT, events[event]['dt']), event))
            output_dict["Since {0}".format(event)] = days_between(TODAY_DT, events[event]['dt'])
    except:
        print("Something wrong happened...")

    if len(output_dict):
        return pd.DataFrame.from_dict(output_dict, orient='index', columns=['days'])
    else:
        return "Sorry, there is no answer :("

In [59]:
def range_calendar(start_dt_str, end_dt_str):
    """Returns anniversaries from `start_dt_str` to `end_dt_str`.
    
    Args:
        start_dt_str (str): 
        end_dt_str (str):
    
    Returns:
        DataFrame
    """
    start_dt = stod(start_dt_str)
    end_dt = stod(end_dt_str)
    output_dict = {}
    
    try:
        for dt in daterange(start_dt, end_dt):
            for event in events.keys():
                event_dt = events[event]['dt']
                if (
                    (rule_multiple(dt, event_dt, 100) and events[event]['importance'] <= 2)
                    or
                    (rule_multiple(dt, event_dt, 1000) and events[event]['importance'] == 3)
                ):
#                     print("{} -- {} days since {}".format(dt, days_between(dt, event_dt), event))
                    output_dict[dt.strftime('%Y-%m-%d')] = {'event': event, 
                                                              'amount': days_between(dt, event_dt), 
                                                              'unit': 'day'}
                if rule_anniversary(dt, event_dt):
#                     print("{} -- {} years since {}".format(dt, rule_anniversary(dt, event_dt), event))
                    output_dict[dt.strftime('%Y-%m-%d')] = {'event': event, 
                                                              'amount': rule_anniversary(dt, event_dt), 
                                                              'unit': 'year'}
    
    except:
        print("Something wrong happened...")

    if len(output_dict):
        return pd.DataFrame.from_dict(output_dict, orient='index', columns=['event', 'amount', 'unit'])
    else:
        return "Sorry, there is no answer :("

In [34]:
def age_counter(given_dt_str):
    """Returns dataframe with data about ages (in days) at `given_dt_str`.
    
    Args:
        given_dt_str (str): 
    
    Returns:
        DataFrame
    """
    given_dt = stod(given_dt_str)
    birth_dict = birth_dates()
    output_dict = {}
    
    try:
        for k in birth_dict.keys():
#             print("{0}'s age: {1} days".format(k, days_between(given_dt, birth_dict[k])))
            output_dict["{0}'s age".format(k)] = days_between(given_dt, birth_dict[k])

        if len(birth_dict.keys()) > 1:
#             print("Total age: {} days".format(sum([days_between(given_dt, birth_dict[k]) for k in birth_dict.keys()])))
            output_dict["Total age"] = sum([days_between(given_dt, birth_dict[k]) for k in birth_dict.keys()])
            for (k1, k2) in combinations(birth_dict.keys(), 2):
#                 print("Age difference between {0} and {1}: {2} days".format(k1, k2, days_between(birth_dict[k1], birth_dict[k2])))
                output_dict["Age difference between {0} and {1}".format(k1, k2)] = days_between(birth_dict[k1], birth_dict[k2])
#         print("Ages were calculated.")
    
    except:
        print("Something wrong happened...")

    if len(output_dict):
        return pd.DataFrame.from_dict(output_dict, orient='index', columns=['days'])
    else:
        return "Sorry, there is no answer :("

In [32]:
def total_age_anniversaries(start_dt_str, end_dt_str, n=1000):
    """Returns dates from `start_dt` to `end_dt` in which total age (in days) 
    is close to be multiple of `n`.
    
    Args:
        start_dt_str (str): 
        end_dt_str (str): 
        n (int): The number for checking multiplicity (more or equal 10). Default value is 1000.
    
    Returns:
        DataFrame
    """
    start_dt = stod(start_dt_str)
    end_dt = stod(end_dt_str)
    birth_dict = birth_dates()
    output_dict = {}
    
    try:
        for dt in daterange(start_dt, end_dt):
            total_age = sum([days_between(dt, birth_dict[k]) for k in birth_dict.keys()])
            if n >= 10 and total_age % n in range(len(birth_dict)):
#                 print("{} -- {} days of their combined age".format(dt.strftime('%Y-%m-%d'), total_age))
                output_dict[dt.strftime('%Y-%m-%d')] = total_age
    except:
        print("Something wrong happened...")
    
    if len(output_dict):
        return pd.DataFrame.from_dict(output_dict, orient='index', columns=['days'])
    else:
        return "Sorry, there is no answer :("

In [43]:
def differences_inside_set(n=100):
    """Returns DataFrame with round dates (in days) between events in events dictionary.
    
    Args:
        n (int): The base of round dates. Default value is 100. 
        
    Returns:
        DataFrame
    """
    inside_dict = {}

    try:
        for event1 in events.keys():
            for event2 in events.keys():
                if (
                    days_between(events[event1]['dt'], events[event2]['dt']) % n == 0 and 
                    event1 != event2 and 
                    events[event1]['dt'] < events[event2]['dt']
                ):
    #                 print("{} days between {} and {}".format(days_between(events[event1]['dt'], events[event2]['dt']), event1, event2))
                    inside_dict["Between {} and {}".format(event1, event2)] = days_between(events[event1]['dt'], events[event2]['dt'])
    except:
        print("Something wrong happened...")

    if len(inside_dict):
        return pd.DataFrame.from_dict(inside_dict, orient='index', columns=['days'])
    else:
        return "Sorry, there is no answer :("

# 3. Performing

In [47]:
# today_counter()

# ok

                           days
Since Philip              37237
Since Elizabeth           35461
Since Engagement          27712
Since Wedding             27578
Since Charles' birth      27218
Since Anne's birth        26579
Since Beginning of reign  26039
Since Coronation          25557
Since Andrew's birth      23104
Since Edward's birth      21623
Since Philip's death        774
Since Elizabeth's death     257

In [62]:
# range_calendar('2022-01-01', '2022-05-01') 

# ok

                         event  amount  unit
2022-01-04      Andrew's birth   22600   day
2022-01-29        Anne's birth   26100   day
2022-01-30             Wedding   27100   day
2022-02-03      Philip's death     300   day
2022-02-06  Beginning of reign      70  year
2022-02-16           Elizabeth   35000   day
2022-02-19      Andrew's birth      62  year
2022-02-20   Elizabeth's death     200   day
2022-03-10      Edward's birth      58  year
2022-03-12              Philip   36800   day
2022-03-26      Edward's birth   21200   day
2022-03-31      Charles' birth   26800   day
2022-04-09      Philip's death       1  year
2022-04-14      Andrew's birth   22700   day
2022-04-21           Elizabeth      96  year

In [35]:
# given_dt = events["Philip's death"]['date']

# age_counter(given_dt)
# age_counter("")

# ok

                                              days
Philip's age                                 36463
Elizabeth's age                              34687
Total age                                    71150
Age difference between Philip and Elizabeth   1776

In [33]:
# start_dt = events['Engagement']['date']
# end_dt = events["Philip's death"]['date']

# total_age_anniversaries(start_dt, end_dt)
# total_age_anniversaries(start_dt, "")

# ok

             days
1948-07-06  18000
1949-11-18  19000
1951-04-02  20000
1952-08-14  21000
1953-12-27  22000
1955-05-11  23000
1956-09-22  24000
1958-02-04  25000
1959-06-19  26000
1960-10-31  27000
1962-03-15  28000
1963-07-28  29000
1964-12-09  30000
1966-04-23  31000
1967-09-05  32000
1969-01-17  33000
1970-06-01  34000
1971-10-14  35000
1973-02-25  36000
1974-07-10  37000
1975-11-22  38000
1977-04-05  39000
1978-08-18  40000
1979-12-31  41000
1981-05-14  42000
1982-09-26  43000
1984-02-08  44000
1985-06-22  45000
1986-11-04  46000
1988-03-18  47000
1989-07-31  48000
1990-12-13  49000
1992-04-26  50000
1993-09-08  51000
1995-01-21  52000
1996-06-04  53000
1997-10-17  54000
1999-03-01  55000
2000-07-13  56000
2001-11-25  57000
2003-04-09  58000
2004-08-21  59000
2006-01-03  60000
2007-05-18  61000
2008-09-29  62000
2010-02-11  63000
2011-06-26  64000
2012-11-07  65000
2014-03-22  66000
2015-08-04  67000
2016-12-16  68000
2018-04-30  69000
2019-09-12  70000
2021-01-24  71000

In [45]:
# differences_inside_set()

# ok

                                           days
Between Coronation and Elizabeth's death  25300

In [21]:
# today_counter(events)

In [22]:
# range_calendar(date.today(), date(2023, 12, 31))

In [23]:
# birthday_dt_1 = events["Elizabeth"]['date']
# birthday_dt_2 = events["Philip"]['date']
# given_dt = events["Philip's death"]['date']

In [24]:
# total_age_anniversaries(birthday_dt_1, birthday_dt_2, events['Engagement']['date'], events["Philip's death"]['date'])

In [25]:
# differences_inside_set(events)

In [26]:
# str -> date: datetime.strptime(dt, "%Y-%m-%d").date()
# date -> str: dt.strftime('%Y-%m-%d')

#  in 'YYYY-MM-DD' format

In [29]:
if __name__=="__main__":
    print(age_counter('2021-04-09'))

                                              days
Philip's age                                 36463
Elizabeth's age                              34687
Age difference between Philip and Elizabeth   1776
Total age                                    71150